genestealer/everblu-meters-esp8266-improved/src/main.cpp
/*
 * Project: EverBlu Meters ESP8266/ESP32
 * Description: Fetch water/gas usage data from Itron EverBlu Cyble Enhanced RF water and gas meters using the RADIAN protocol on 433 MHz.
 *              Integrated with Home Assistant via MQTT AutoDiscovery.
 *              Supports both water meters (readings in L) and gas meters (readings in m³).
 * Author: Forked and improved by Genestealer, based on work by Psykokwak and Neutrinus.
 * License: Unknown (refer to the README for details).
 *
 * Hardware Requirements:
 * - ESP8266/ESP32
 * - CC1101 RF Transceiver
 *
 * Features:
 * - MQTT integration for Home Assistant
 * - Automatic frequency synthesizer calibration and offset compensation
 * - Wi-Fi diagnostics and OTA updates
 * - Daily scheduled meter readings
 *
 * For more details, refer to the README file.
 */

#include "private.h"        // Include private configuration (Wi-Fi, MQTT, etc.)
#include "everblu_meters.h" // Include EverBlu meter communication library
#include "version.h"        // Firmware version definition
#include "wifi_serial.h"    // WiFi serial monitor
#if defined(ESP8266)
#include <ESP8266WiFi.h> // Wi-Fi library for ESP8266
#include <ESP8266mDNS.h> // mDNS library for ESP8266
#include <EEPROM.h>      // EEPROM library for ESP8266
#elif defined(ESP32)
#include <WiFi.h>         // Wi-Fi library for ESP32
#include <ESPmDNS.h>      // mDNS library for ESP32
#include <Preferences.h>  // Preferences library for ESP32
#include <esp_task_wdt.h> // Watchdog timer for ESP32
#endif
#include <Arduino.h>       // Core Arduino library
#include <ArduinoOTA.h>    // OTA update library
#include <EspMQTTClient.h> // MQTT client library
#include <math.h>          // For floor/ceil during scan alignment

// Cross-platform watchdog feed helper
static inline void FEED_WDT()
{
#if defined(ESP8266)
  ESP.wdtFeed();
#elif defined(ESP32)
  esp_task_wdt_reset();
  yield();
#else
  (void)0;
#endif
}

// Define the LED_BUILTIN pin if missing
#ifndef LED_BUILTIN
#define LED_BUILTIN 2 // Change this pin if needed
#endif

// ------------------------------
// Connectivity watchdog settings
// ------------------------------
// Maximum time to wait for Wi-Fi to connect before forcing a retry
static const unsigned long WIFI_CONNECT_TIMEOUT_MS = 30000UL; // 30s
// Maximum time to wait for MQTT to connect (with Wi-Fi up) before logging a warning
static const unsigned long MQTT_CONNECT_TIMEOUT_MS = 30000UL; // 30s
// If the device stays offline for too long, perform a safety reboot (set to 0 to disable)
static const unsigned long OFFLINE_REBOOT_AFTER_MS = 6UL * 60UL * 60UL * 1000UL; // 6 hours
// LED blink while offline (visual feedback)
static const unsigned long OFFLINE_LED_BLINK_MS = 500UL;

// Define the Wi-Fi PHY mode if missing from the private.h file
#ifndef ENABLE_WIFI_PHY_MODE_11G
#define ENABLE_WIFI_PHY_MODE_11G 0 // Set to 1 to enable 11G PHY mode
#endif

// Define MQTT debugging if missing from the private.h file
#ifndef ENABLE_MQTT_DEBUGGING
#define ENABLE_MQTT_DEBUGGING 0 // Set to 1 to enable MQTT debugging messages
#endif

// Define the default reading schedule if missing from the private.h file.
// Options: "Monday-Friday", "Monday-Saturday", or "Monday-Sunday"
#ifndef DEFAULT_READING_SCHEDULE
#define DEFAULT_READING_SCHEDULE "Monday-Friday"
#endif

// Optional: configurable daily read time in UTC (hour/minute)
// If not defined in private.h, defaults to 10:00 UTC
#ifndef DEFAULT_READING_HOUR_UTC
#define DEFAULT_READING_HOUR_UTC 10
#endif
#ifndef DEFAULT_READING_MINUTE_UTC
#define DEFAULT_READING_MINUTE_UTC 0
#endif

// Simple time zone offset (minutes from UTC). Positive for east of UTC, negative for west.
#ifndef TIMEZONE_OFFSET_MINUTES
#define TIMEZONE_OFFSET_MINUTES 0
#endif

// Auto-align scheduled reading time to the meter's wake window (time_start/time_end)
// 1 = enabled (default), 0 = disabled
#ifndef AUTO_ALIGN_READING_TIME
#define AUTO_ALIGN_READING_TIME 1
#endif

// Alignment strategy: 0 = use time_start, 1 = use midpoint of [time_start, time_end]
#ifndef AUTO_ALIGN_USE_MIDPOINT
#define AUTO_ALIGN_USE_MIDPOINT 1
#endif

// Control whether the firmware performs the wide-band auto scan on first boot
// 1 = enabled (default), 0 = disabled
#ifndef AUTO_SCAN_ENABLED
#define AUTO_SCAN_ENABLED 1
#endif

// Resolved reading time (UTC) which may be updated dynamically after a successful read
// Resolved reading time:
// - UTC fields: scheduled time in UTC
// - Local fields: scheduled time in UTC+offset (TIMEZONE_OFFSET_MINUTES)
// These may be updated dynamically after a successful read (auto-align).
static int g_readHourUtc = DEFAULT_READING_HOUR_UTC;
static int g_readMinuteUtc = DEFAULT_READING_MINUTE_UTC;
static int g_readHourLocal = DEFAULT_READING_HOUR_UTC;
static int g_readMinuteLocal = DEFAULT_READING_MINUTE_UTC;

// Define a default meter frequency if missing from private.h.
// RADIAN protocol nominal center frequency for EverBlu is 433.82 MHz.
#ifndef FREQUENCY
#define FREQUENCY 433.82
#define FREQUENCY_DEFINED_DEFAULT 1
#else
#define FREQUENCY_DEFINED_DEFAULT 0
#endif

unsigned long lastWifiUpdate = 0;

// Read success/failure metrics
unsigned long totalReadAttempts = 0;
unsigned long successfulReads = 0;
unsigned long failedReads = 0;
const char *lastErrorMessage = "None";

// Frequency offset storage
#define EEPROM_SIZE 64
#define FREQ_OFFSET_ADDR 0
#define FREQ_OFFSET_MAGIC 0xABCD // Magic number to verify valid data
float storedFrequencyOffset = 0.0;
bool autoScanEnabled = (AUTO_SCAN_ENABLED != 0); // Enable automatic scan on first boot if no offset found
int successfulReadsBeforeAdapt = 0;              // Track successful reads for adaptive tuning
float cumulativeFreqError = 0.0;                 // Accumulate FREQEST readings for adaptive adjustment
const int ADAPT_THRESHOLD = 10;                  // Adapt frequency after N successful reads

#if defined(ESP32)
Preferences preferences;
#endif

// ============================================================================
// Frequency Management API
// ============================================================================

/**
 * @brief Save frequency offset to persistent storage
 *
 * Stores the frequency offset value to EEPROM (ESP8266) or Preferences (ESP32)
 * with a magic number for validation. This offset is applied on next boot.
 *
 * @param offset Frequency offset in MHz to be added to base frequency
 */
void saveFrequencyOffset(float offset);

/**
 * @brief Load frequency offset from persistent storage
 *
 * Retrieves previously saved frequency offset from EEPROM (ESP8266) or
 * Preferences (ESP32). Validates data integrity using magic number.
 *
 * @return Frequency offset in MHz, or 0.0 if no valid data found
 */
float loadFrequencyOffset();

/**
 * @brief Perform narrow-range frequency scan
 *
 * Scans a narrow frequency range (±0.003 MHz around current frequency)
 * with fine step resolution (0.0005 MHz) to find optimal meter frequency.
 * Used for fine-tuning when close to correct frequency.
 *
 * Updates global frequency offset if better frequency is found.
 */
void performFrequencyScan();

/**
 * @brief Perform wide-range initial frequency scan
 *
 * Performs comprehensive frequency scan over wider range (±0.030 MHz)
 * with coarser step resolution (0.001 MHz). Used on first boot or when
 * no stored offset exists. More time-consuming but covers larger uncertainty.
 *
 * Saves discovered offset to persistent storage on success.
 */
void performWideInitialScan();

// ============================================================================
// Frequency Management Implementation
// ============================================================================

/**
 * @brief Adaptive frequency tracking using FREQEST
 *
 * Accumulates frequency offset estimates from successful reads and gradually
 * adjusts radio frequency to track meter drift. Uses statistical averaging
 * (ADAPT_THRESHOLD reads) to avoid over-correction on noise.
 *
 * FREQEST register provides frequency error estimate in 2's complement format,
 * with resolution ~1.59 kHz per LSB (26 MHz crystal).
 *
 * Adjustment logic:
 * - Accumulate FREQEST over multiple reads
 * - After threshold reads, calculate average error
 * - If average > 2 kHz, apply 50% correction to avoid oscillation
 * - Save new offset to persistent storage
 * - Reinitialize CC1101 with corrected frequency
 *
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest);

// Secrets pulled from private.h file
EspMQTTClient mqtt(
    SECRET_WIFI_SSID,      // Your Wifi SSID
    SECRET_WIFI_PASSWORD,  // Your WiFi key
    SECRET_MQTT_SERVER,    // MQTT Broker server ip
    SECRET_MQTT_USERNAME,  // MQTT Username Can be omitted if not needed
    SECRET_MQTT_PASSWORD,  // MQTT Password Can be omitted if not needed
    SECRET_MQTT_CLIENT_ID, // MQTT Client name that uniquely identify your device
    1883                   // MQTT Broker server port
);

// Base MQTT topic prefix for all EverBlu Cyble entities
// Centralising this avoids repeating "everblu/cyble/" all over the code.
// mqttBaseTopic is initialized at global scope using compile-time string
// concatenation with METER_SERIAL (via TOSTRING) and is only printed in setup().

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

// Define the default maximum retries if missing from the private.h file
#ifndef MAX_RETRIES
#define MAX_RETRIES 10 // Default: 10 retry attempts before cooldown
#endif

int _retry = 0;
const int max_retries = MAX_RETRIES;          // Maximum number of retry attempts (configurable in private.h)
unsigned long lastFailedAttempt = 0;          // Timestamp of last failed attempt
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds

