genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Map the clamped RSSI value to a percentage (0-100%)
  return map(clamped_rssi, -120, -40, 0, 100);
}

/**
 * @brief Convert LQI to percentage
 *
 * Converts CC1101 Link Quality Indicator (0-255) to 0-100% scale.
 * LQI represents overall link quality including interference effects.
 *
 * @param lqi Link Quality Indicator (0-255, higher is better)
 * @return Link quality as percentage (0-100)
 */
int calculateLQIToPercentage(int lqi)
{
  int strength = constrain(lqi, 0, 255); // Clamp LQI to valid range
  return map(strength, 0, 255, 0, 100);  // Map LQI to percentage
}

// ------------------------------
// Connectivity watchdog state
// ------------------------------
static unsigned long g_bootMillis = 0;
static unsigned long g_wifiAttemptStartMs = 0;
static unsigned long g_mqttAttemptStartMs = 0;
static unsigned long g_wifiOfflineSince = 0;
static unsigned long g_mqttOfflineSince = 0;
static unsigned long g_lastConnLogMs = 0;
static unsigned long g_lastLedBlinkMs = 0;
static bool g_ledState = false;
static bool g_prevWifiUp = false;
static bool g_prevMqttUp = false;

// Helper: translate Wi-Fi wl_status_t to readable string
static const char *wifiStatusToString(wl_status_t st)
{
  switch (st)
  {
  case WL_IDLE_STATUS:
    return "IDLE (starting up)";
  case WL_NO_SSID_AVAIL:
    return "NO_SSID_AVAIL (SSID not found)";
  case WL_SCAN_COMPLETED:
    return "SCAN_COMPLETED";
  case WL_CONNECTED:
    return "CONNECTED";
  case WL_CONNECT_FAILED:
    return "CONNECT_FAILED";
  case WL_CONNECTION_LOST:
    return "CONNECTION_LOST";
  case WL_DISCONNECTED:
    return "DISCONNECTED";
#ifdef WL_WRONG_PASSWORD
  case WL_WRONG_PASSWORD:
    return "WRONG_PASSWORD";
#endif
  default:
    return "UNKNOWN";
  }
}

// Function: onUpdateData
// Description: Fetches data from the water and gas meter and publishes it to MQTT topics.
//              Retries up to 10 times if data retrieval fails.
void onUpdateData()
{
  Serial.printf("Updating data from meter...\n");
  Serial.printf("Retry count : %d\n", _retry);
  Serial.printf("Reading schedule : %s\n", readingSchedule);

  // Increment total attempts counter
  totalReadAttempts++;

  // Indicate activity with LED
  digitalWrite(LED_BUILTIN, LOW); // Turn on LED to indicate activity

  // Notify MQTT that active reading has started
  mqtt.publish(String(mqttBaseTopic) + "/active_reading", "true", true);
  mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Reading", true);

  struct tmeter_data meter_data = get_meter_data(); // Fetch meter data

  // Get current UTC time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);

  char iso8601[128];
  strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));

  // Handle data retrieval failure (including first-layer protection rejecting
  // corrupted frames and returning zeros).
  if (meter_data.reads_counter == 0 || meter_data.volume == 0)
  {
    Serial.printf("Unable to retrieve data from meter (attempt %d/%d)\n", _retry + 1, max_retries);

    if (_retry < max_retries - 1)
    {
      // Schedule retry using callback instead of recursion to prevent stack overflow
      _retry++;
      static char errorMsg[64];
      snprintf(errorMsg, sizeof(errorMsg), "Retry %d/%d - No data received", _retry, max_retries);
      lastErrorMessage = errorMsg;
      Serial.printf("Scheduling retry in 10 seconds... (next attempt %d/%d)\n", _retry + 1, max_retries);
      mqtt.publish(String(mqttBaseTopic) + "/active_reading", "false", true);
      mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Idle", true);
      mqtt.publish(String(mqttBaseTopic) + "/last_error", lastErrorMessage, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      // Use non-blocking callback instead of recursive call
      mqtt.executeDelayed(10000, onUpdateData);
    }
    else
    {
      // Max retries reached, enter cooldown period
      lastFailedAttempt = millis();
      failedReads++;
      lastErrorMessage = "Max retries reached - cooling down";
      Serial.printf("Max retries (%d) reached. Entering 1-hour cooldown period.\n", max_retries);
      mqtt.publish(String(mqttBaseTopic) + "/active_reading", "false", true);
      mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Idle", true);
      mqtt.publish(String(mqttBaseTopic) + "/status_message", "Failed after max retries, cooling down for 1 hour", true);
      mqtt.publish(String(mqttBaseTopic) + "/last_error", lastErrorMessage, true);

      char buffer[16];
      snprintf(buffer, sizeof(buffer), "%lu", failedReads);
      mqtt.publish(String(mqttBaseTopic) + "/failed_reads", buffer, true);

      snprintf(buffer, sizeof(buffer), "%lu", totalReadAttempts);
      mqtt.publish(String(mqttBaseTopic) + "/total_attempts", buffer, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      _retry = 0;                      // Reset retry counter for next scheduled attempt
    }
    return;
  }

  // Format int time_start and time_end as "HH:MM"
  char timeStartFormatted[6];
  char timeEndFormatted[6];
  int timeStart = constrain(meter_data.time_start, 0, 23); // Ensure valid hour range
  int timeEnd = constrain(meter_data.time_end, 0, 23);     // Ensure valid hour range
  snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", timeStart);
  snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", timeEnd);

  Serial.printf("Data from meter:\n");
  if (meterIsGas)
  {
    Serial.printf("%s : %.3f\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n",
                  meterUnit, meter_data.volume / 1000.0, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  }
  else
  {
    Serial.printf("%s : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n",
                  meterUnit, meter_data.volume, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  }
  Serial.printf("RSSI (dBm) : %d\n", meter_data.rssi_dbm);
  Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  Serial.printf("Signal quality (LQI) : %d\n", meter_data.lqi);
  Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(meter_data.lqi));

  // Publish meter data to MQTT (using char buffers instead of String)
  // For gas meters, convert from liters to cubic meters (m³)
  char valueBuffer[32];

  if (meterIsGas)
  {
    // Gas meters: publish value in m³ (volume / 1000)
    float cubicMeters = meter_data.volume / 1000.0;
    snprintf(valueBuffer, sizeof(valueBuffer), "%.3f", cubicMeters);
  }
  else
  {
    // Water meters: publish value in liters
    snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.volume);
  }
  mqtt.publish(String(mqttBaseTopic) + "/liters", valueBuffer, true);
  delay(5);

  // Publish historical data as JSON attributes for Home Assistant
  // This provides 13 months of historical volume readings that can be accessed as attributes
  // in Home Assistant. Each value represents the total volume at the end of that month.
  // The meter stores these internally with timestamps, but the RADIAN protocol only
  // returns the volume values without dates.
  int num_history = 0;
  if (meter_data.history_available)
  {
    // Count valid historical values (non-zero)
    for (int i = 0; i < 13; i++)
    {
      if (meter_data.history[i] == 0)
        break;
      num_history++;
    }

    // If the history block was marked available but contained no
    // non‑zero entries, treat it as unavailable for this frame.
    if (num_history == 0)
    {
      Serial.println("WARN: history_available=true but no non-zero history entries found - skipping history publish for this frame");
      meter_data.history_available = false;
    }
  }

