genestealer/everblu-meters-esp8266-improved/src/main.cpp
  if (meter_data.history_available)
  {

    Serial.printf("\n=== Historical Data (%d months) ===\n", num_history);
    Serial.println("Month  Volume (L)  Usage (L)");
    Serial.println("-----  ----------  ---------");

    // Calculate monthly consumption from the historical data
    // Format: {"history": [oldest_volume, ..., newest_volume], "monthly_usage": [month1_usage, ..., month13_usage]}
    // The attributes JSON can become relatively large when all 13 history
    // slots are populated. Use a sufficiently large buffer and carefully
    // track remaining space to avoid truncation that would yield malformed
    // JSON on MQTT.
    char historyJson[1024];
    int pos = 0;

    // Start JSON object
    int remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer too small before writing header - skipping history publish");
      // Nothing written, just bail out of history publishing for this frame.
      return;
    }
    pos += snprintf(historyJson + pos, remaining, "{\"history\":[");

    // Add historical volumes and print to serial
    for (int i = 0; i < num_history; i++)
    {
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing history array - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), meter_data.history[i]);

      // Calculate and display monthly usage
      uint32_t usage = 0;
      if (i > 0 && meter_data.history[i] > meter_data.history[i - 1])
      {
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      Serial.printf(" -%02d   %10u  %9u\n", num_history - i, meter_data.history[i], usage);
    }

    // Calculate current month usage (difference from most recent historical reading).
    // Declare these outside of any goto targets to avoid crossing initialisation
    // when jumping to finalize_history_json.
    uint32_t currentMonthUsage = 0;
    uint32_t currentVolume = static_cast<uint32_t>(meter_data.volume);
    if (num_history > 0 && currentVolume > meter_data.history[num_history - 1])
    {
      currentMonthUsage = currentVolume - meter_data.history[num_history - 1];
    }
    Serial.printf("  Now  %10d  %9u (current month usage: %u L)\n", meter_data.volume, currentVolume, currentMonthUsage);
    Serial.println("===================================\n");

    // Add monthly usage calculations to JSON
    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before monthly_usage - truncating");
      // Close what we have so far and publish best-effort JSON.
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining, "],\"monthly_usage\":[");
    for (int i = 0; i < num_history; i++)
    {
      uint32_t usage;
      if (i == 0)
      {
        // For oldest month, we can't calculate usage without an older baseline
        usage = 0;
      }
      else if (meter_data.history[i] > meter_data.history[i - 1])
      {
        // Calculate consumption as difference between consecutive months
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      else
      {
        usage = 0; // Sanity check - shouldn't go backwards
      }
      remaining = sizeof(historyJson) - pos;
      if (remaining <= 1)
      {
        Serial.println("ERROR: historyJson buffer full while writing monthly_usage - truncating");
        break;
      }
      pos += snprintf(historyJson + pos, remaining, "%s%u",
                      (i > 0 ? "," : ""), usage);
    }

    remaining = sizeof(historyJson) - pos;
    if (remaining <= 1)
    {
      Serial.println("ERROR: historyJson buffer full before tail - truncating");
      historyJson[sizeof(historyJson) - 1] = '\0';
      Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
      mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
      delay(5);
      Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                    num_history, currentMonthUsage);
      goto skip_history_publish;
    }
    pos += snprintf(historyJson + pos, remaining,
                    "],\"current_month_usage\":%u,\"months_available\":%d}",
                    currentMonthUsage, num_history);

    // Ensure null termination even if we had to truncate early.
    historyJson[sizeof(historyJson) - 1] = '\0';

    Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
    mqtt.publish(String(mqttBaseTopic) + "/liters_attributes", historyJson, true);
    delay(5);

    Serial.printf("> Published %d months historical data (current month usage: %u L)\n",
                  num_history, currentMonthUsage);
  }

skip_history_publish:;

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.reads_counter);
  mqtt.publish(String(mqttBaseTopic) + "/counter", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.battery_left);
  mqtt.publish(String(mqttBaseTopic) + "/battery", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.rssi_dbm);
  mqtt.publish(String(mqttBaseTopic) + "/rssi_dbm", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  mqtt.publish(String(mqttBaseTopic) + "/rssi_percentage", valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.lqi);
  mqtt.publish(String(mqttBaseTopic) + "/lqi", valueBuffer, true);
  delay(5);
  mqtt.publish(String(mqttBaseTopic) + "/time_start", timeStartFormatted, true);
  delay(5);
  mqtt.publish(String(mqttBaseTopic) + "/time_end", timeEndFormatted, true);
  delay(5);
  mqtt.publish(String(mqttBaseTopic) + "/timestamp", iso8601, true); // timestamp since epoch in UTC
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateLQIToPercentage(meter_data.lqi));
  mqtt.publish(String(mqttBaseTopic) + "/lqi_percentage", valueBuffer, true);
  delay(5);

  // Publish all data as a JSON message as well this is redundant but may be useful for some
  char json[512];
  sprintf(json, jsonTemplate, meter_data.volume, meter_data.reads_counter, meter_data.battery_left, meter_data.rssi, iso8601);
  mqtt.publish(String(mqttBaseTopic) + "/json", json, true);
  delay(5);

#if AUTO_ALIGN_READING_TIME
  // Optionally auto-align the daily scheduled reading time to the meter's wake window
  {
    int timeStart = constrain(meter_data.time_start, 0, 23);
    int timeEnd = constrain(meter_data.time_end, 0, 23);
    int window = (timeEnd - timeStart + 24) % 24; // hours in window (0 means unknown/all-day)

    if (window > 0)
    {
#if AUTO_ALIGN_USE_MIDPOINT
      int alignedHourLocal = (timeStart + (window / 2)) % 24; // midpoint (interpreted as local-offset time)
#else
      int alignedHourLocal = timeStart; // start of window (local-offset time)
#endif
      int alignedMinuteLocal = g_readMinuteLocal;
      updateResolvedScheduleFromLocal(alignedHourLocal, alignedMinuteLocal);

      // Publish updated reading_time HH:MM
      char readingTimeFormatted2[6];
      snprintf(readingTimeFormatted2, sizeof(readingTimeFormatted2), "%02d:%02d", g_readHourUtc, g_readMinuteUtc);
      mqtt.publish(String(mqttBaseTopic) + "/reading_time", readingTimeFormatted2, true);
      delay(5);

      Serial.printf("> Auto-aligned reading time to %02d:%02d local-offset (%02d:%02d UTC) (window %02d-%02d local)\n",
                    g_readHourLocal, g_readMinuteLocal, g_readHourUtc, g_readMinuteUtc, timeStart, timeEnd);
    }
  }
#endif

  // Notify MQTT that active reading has ended
  mqtt.publish(String(mqttBaseTopic) + "/active_reading", "false", true);
  mqtt.publish(String(mqttBaseTopic) + "/cc1101_state", "Idle", true);
  digitalWrite(LED_BUILTIN, HIGH); // Turn off LED to indicate completion

  // Reset retry counter and cooldown on successful read
  _retry = 0;
  lastFailedAttempt = 0;
  successfulReads++;
  lastErrorMessage = "None";

  // Publish success metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  mqtt.publish(String(mqttBaseTopic) + "/successful_reads", metricBuffer, true);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  mqtt.publish(String(mqttBaseTopic) + "/total_attempts", metricBuffer, true);

  mqtt.publish(String(mqttBaseTopic) + "/last_error", "None", true);

  // Perform adaptive frequency tracking based on FREQEST register
  adaptiveFrequencyTracking(meter_data.freqest);

