genestealer/everblu-meters-esp8266-improved/src/main.cpp
  Serial.printf("Data update complete.\n\n");
}

// Function: onScheduled
// Function: onScheduled
// Description: Schedules daily meter readings at the configured local-offset time.
void onScheduled()
{
  time_t tnow = time(nullptr);
  // Compute local-offset time by adding offset minutes to UTC epoch
  time_t tlocal = tnow + (time_t)TIMEZONE_OFFSET_MINUTES * 60;
  struct tm *ptm = gmtime(&tlocal);

  // Check if today is a valid reading day
  const bool timeMatch = (ptm->tm_hour == g_readHourLocal && ptm->tm_min == g_readMinuteLocal);

  if (isReadingDay(ptm) && timeMatch && ptm->tm_sec == 0)
  {
    // Check if we're still in cooldown period after failed attempts
    if (lastFailedAttempt > 0 && (millis() - lastFailedAttempt) < RETRY_COOLDOWN)
    {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      Serial.printf("Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);

      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
      snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
      mqtt.publish(topicBuffer, cooldownMsg, true);
      mqtt.executeDelayed(500, onScheduled);
      return;
    }

    // Cooldown period is over, reset and proceed
    lastFailedAttempt = 0;

    // Call back in 23 hours
    mqtt.executeDelayed(1000 * 60 * 60 * 23, onScheduled);

    Serial.println("It is time to update data from meter :)");

    // Update data
    _retry = 0;
    onUpdateData();
    return;
  }

  // Check every 500 ms
  mqtt.executeDelayed(500, onScheduled);
}

// ============================================================================
// Home Assistant MQTT Discovery Helper Functions
// ============================================================================
// Supported abbreviations in MQTT discovery messages for Home Assistant
// Used to reduce the size of the JSON payload
// https://www.home-assistant.io/integrations/mqtt/#supported-abbreviations-in-mqtt-discovery-messages

// Helper function to build JSON device block with METER_SERIAL
String buildDeviceJson()
{
  // Pre-allocate memory to prevent heap fragmentation
  // Estimated size: ~250 bytes for device JSON
  String json;
  json.reserve(300);

  json = "\"ids\": [\"" + String(METER_SERIAL) + "\"],\n";
  json += "    \"name\": \"EverBlu Meter " + String(METER_SERIAL) + "\",\n";
  json += "    \"mdl\": \"Itron EverBlu Cyble Enhanced Water and Gas Meter ESP8266/ESP32\",\n";
  json += "    \"mf\": \"Genestealer\",\n";
  json += "    \"sw\": \"" EVERBLU_FW_VERSION "\",\n";
  json += "    \"cu\": \"https://github.com/genestealer/everblu-meters-esp8266-improved\"";
  return json;
}

// Helper function to build discovery JSON for a sensor
String buildDiscoveryJson(const char *name, const char *entity_id, const char *icon,
                          const char *unit = nullptr, const char *dev_class = nullptr,
                          const char *state_class = nullptr, const char *ent_category = nullptr)
{
  // Pre-allocate memory to prevent heap fragmentation from multiple reallocations
  // Estimated size: base structure (~350 bytes) + optional fields (~100 bytes)
  String json;
  json.reserve(512);

  json = "{\n";
  json += "  \"name\": \"" + String(name) + "\",\n";
  json += "  \"uniq_id\": \"" + String(METER_SERIAL) + "_" + String(entity_id) + "\",\n";
  json += "  \"obj_id\": \"" + String(METER_SERIAL) + "_" + String(entity_id) + "\",\n";
  if (icon)
    json += "  \"ic\": \"" + String(icon) + "\",\n";
  if (unit)
    json += "  \"unit_of_meas\": \"" + String(unit) + "\",\n";
  if (dev_class)
    json += "  \"dev_cla\": \"" + String(dev_class) + "\",\n";
  if (state_class)
    json += "  \"stat_cla\": \"" + String(state_class) + "\",\n";
  json += "  \"qos\": 0,\n";
  json += "  \"avty_t\": \"" + String(mqttBaseTopic) + "/status\",\n";
  json += "  \"stat_t\": \"" + String(mqttBaseTopic) + "/" + String(entity_id) + "\",\n";
  json += "  \"frc_upd\": true,\n";
  if (ent_category)
    json += "  \"ent_cat\": \"" + String(ent_category) + "\",\n";
  json += "  \"dev\": {\n    " + buildDeviceJson() + "\n  }\n";
  json += "}";
  return json;
}

// NOTE: Old PROGMEM JSON strings removed - now using dynamic publishHADiscovery() function
// This allows entity IDs and MQTT topics to include METER_SERIAL for multi-meter support

// Function: publishWifiDetails
// Description: Publishes Wi-Fi diagnostics (IP, RSSI, signal strength, etc.) to MQTT.
void publishWifiDetails()
{
  Serial.println("> Publish Wi-Fi details");

  // Get WiFi details (use String for network functions that return String)
  char wifiIP[16];
  snprintf(wifiIP, sizeof(wifiIP), "%s", WiFi.localIP().toString().c_str());

  int wifiRSSI = WiFi.RSSI();
  int wifiSignalPercentage = calculateWiFiSignalStrengthPercentage(wifiRSSI);

  char macAddress[18];
  snprintf(macAddress, sizeof(macAddress), "%s", WiFi.macAddress().c_str());

  char wifiSSID[33];
  snprintf(wifiSSID, sizeof(wifiSSID), "%s", WiFi.SSID().c_str());

  char wifiBSSID[18];
  snprintf(wifiBSSID, sizeof(wifiBSSID), "%s", WiFi.BSSIDstr().c_str());

  const char *status = (WiFi.status() == WL_CONNECTED) ? "online" : "offline";

  // Uptime calculation
  unsigned long uptimeMillis = millis();
  time_t uptimeSeconds = uptimeMillis / 1000;
  time_t now = time(nullptr);
  time_t uptimeTimestamp = now - uptimeSeconds;
  char uptimeISO[32];
  strftime(uptimeISO, sizeof(uptimeISO), "%FT%TZ", gmtime(&uptimeTimestamp));

  // Publish diagnostic sensors (using char buffers instead of String)
  char valueBuffer[16];
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_ip", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiIP, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiRSSI);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_rssi", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", wifiSignalPercentage);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_signal_percentage", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/mac_address", mqttBaseTopic);
  mqtt.publish(topicBuffer, macAddress, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_ssid", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiSSID, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/wifi_bssid", mqttBaseTopic);
  mqtt.publish(topicBuffer, wifiBSSID, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status", mqttBaseTopic);
  mqtt.publish(topicBuffer, status, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/uptime", mqttBaseTopic);
  mqtt.publish(topicBuffer, uptimeISO, true);
  delay(5);

  Serial.println("> Wi-Fi details published");
}

// Function: publishMeterSettings
// Description: Publishes meter configuration (year, serial, frequency) to MQTT.
void publishMeterSettings()
{
  Serial.println("> Publish meter settings");

  // Publish Meter Year, Serial (using char buffers instead of String)
  char valueBuffer[16];
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];

  snprintf(valueBuffer, sizeof(valueBuffer), "%d", METER_YEAR);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/everblu_meter_year", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

  snprintf(valueBuffer, sizeof(valueBuffer), "%u", METER_SERIAL);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/everblu_meter_serial", mqttBaseTopic);
  mqtt.publish(topicBuffer, valueBuffer, true);
  delay(5);

