genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Publish initial diagnostic metrics (using char buffers instead of String)
  char metricBuffer[16];

  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Idle", true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/total_attempts", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/successful_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);

  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", failedReads);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/failed_reads", mqttBaseTopic);
  mqtt.publish(topicBuffer, metricBuffer, true);
  delay(5);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/last_error", mqttBaseTopic);
  mqtt.publish(topicBuffer, lastErrorMessage, true);
  delay(5);

  char freqBuffer[16];
  snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0); // Convert MHz to kHz
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
  mqtt.publish(topicBuffer, freqBuffer, true);
  delay(5);

  Serial.println("> MQTT config sent");

  // Publish initial Wi-Fi details
  publishWifiDetails();

  // Publish once the meter settings as set in the softeware
  publishMeterSettings();

  // Turn off LED to show everything is setup
  digitalWrite(LED_BUILTIN, HIGH); // turned off

  Serial.println("> Setup done");
  Serial.println("Ready to go...");

  onScheduled();
}

// Function: saveFrequencyOffset
// Description: Saves the frequency offset to persistent storage (EEPROM for ESP8266, Preferences for ESP32)
void saveFrequencyOffset(float offset)
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = FREQ_OFFSET_MAGIC;
  EEPROM.put(FREQ_OFFSET_ADDR, magic);
  EEPROM.put(FREQ_OFFSET_ADDR + 2, offset);
  EEPROM.commit();
  Serial.printf("> Frequency offset %.6f MHz saved to EEPROM\n", offset);
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", false);
  preferences.putFloat("freq_offset", offset);
  preferences.end();
  Serial.printf("> Frequency offset %.6f MHz saved to Preferences\n", offset);
#endif
  storedFrequencyOffset = offset;
}

// Function: loadFrequencyOffset
// Description: Loads the frequency offset from persistent storage, returns 0.0 if not found or invalid
float loadFrequencyOffset()
{
#if defined(ESP8266)
  // ESP8266: Use EEPROM
  uint16_t magic = 0;
  EEPROM.get(FREQ_OFFSET_ADDR, magic);
  if (magic == FREQ_OFFSET_MAGIC)
  {
    float offset = 0.0;
    EEPROM.get(FREQ_OFFSET_ADDR + 2, offset);
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("> Loaded frequency offset %.6f MHz from EEPROM\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("> Invalid frequency offset %.6f MHz in EEPROM, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("> No valid frequency offset found in EEPROM");
  }
#elif defined(ESP32)
  // ESP32: Use Preferences
  preferences.begin("everblu", true); // Read-only
  if (preferences.isKey("freq_offset"))
  {
    float offset = preferences.getFloat("freq_offset", 0.0);
    preferences.end();
    // Sanity check: offset should be reasonable (within ±0.1 MHz)
    if (offset >= -0.1 && offset <= 0.1)
    {
      Serial.printf("> Loaded frequency offset %.6f MHz from Preferences\n", offset);
      return offset;
    }
    else
    {
      Serial.printf("> Invalid frequency offset %.6f MHz in Preferences, using 0.0\n", offset);
    }
  }
  else
  {
    Serial.println("> No frequency offset found in Preferences");
    preferences.end();
  }
#endif
  return 0.0;
}

// Function: performFrequencyScan
// Description: Scans nearby frequencies to find the best signal and updates the offset
void performFrequencyScan()
{
  Serial.println("> Starting frequency scan...");
  Serial.println("> NOTE: Wi-Fi/MQTT connections may temporarily drop and reconnect while the scan is running. This is expected.");
  char topicBuffer[MQTT_TOPIC_BUFFER_SIZE];
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/cc1101_state", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Frequency Scanning", true);
  snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
  mqtt.publish(topicBuffer, "Performing frequency scan", true);

  float baseFreq = FREQUENCY;
  float bestFreq = baseFreq;
  int bestRSSI = -120; // Start with very low RSSI

  // Scan range: ±30 kHz in 5 kHz steps (±0.03 MHz in 0.005 MHz steps)
  float scanStart = baseFreq - 0.03;
  float scanEnd = baseFreq + 0.03;
  float scanStep = 0.005;

  Serial.printf("> Scanning from %.6f to %.6f MHz (step: %.6f MHz)\n", scanStart, scanEnd, scanStep);

  for (float freq = scanStart; freq <= scanEnd; freq += scanStep)
  {
    FEED_WDT(); // Feed watchdog for each frequency step
    // Reinitialize CC1101 with this frequency
    cc1101_init(freq);
    delay(50); // Allow time for frequency to settle

    // Try to get meter data (with short timeout)
    struct tmeter_data test_data = get_meter_data();

    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0)
    {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("> Better signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }
  }

  // Calculate and save the offset
  float offset = bestFreq - baseFreq;
  Serial.printf("> Frequency scan complete. Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n",
                bestFreq, offset, bestRSSI);

  if (bestRSSI > -120)
  { // Only save if we found something
    saveFrequencyOffset(offset);

    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0); // Convert MHz to kHz
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/frequency_offset", mqttBaseTopic);
    mqtt.publish(topicBuffer, freqBuffer, true);

    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Scan complete: offset %.3f kHz, RSSI %d dBm", offset * 1000.0, bestRSSI);
    snprintf(topicBuffer, sizeof(topicBuffer), "%s/status_message", mqttBaseTopic);
    mqtt.publish(topicBuffer, statusMsg, true);

