genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // If no valid frequency offset found and auto-scan is enabled, perform wide initial scan
  if (noStoredOffset && autoScanEnabled)
  {
    Serial.println("> No stored frequency offset found. Performing wide initial scan...");
    performWideInitialScan();
    // Reload the frequency offset after scan
    storedFrequencyOffset = loadFrequencyOffset();
  }
  else if (noStoredOffset)
  {
    Serial.println("> AUTO_SCAN_ENABLED=0; skipping automatic frequency scan (offset remains 0.0 MHz).");
  }

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT) with serial-specific topic
  // Note: mqttLwtTopic is initialized at global scope to ensure it's ready before MQTT client connects
  mqtt.enableLastWillMessage(mqttLwtTopic, "offline", true); // You can activate the retain flag by setting the third parameter to true

  // Make reconnection attempts faster and deterministic
  mqtt.setWifiReconnectionAttemptDelay(15000); // try every 15s
  mqtt.setMqttReconnectionAttemptDelay(15000); // try every 15s
  // In rare cases where the board wedges during connection attempts, allow drastic reset
  mqtt.enableDrasticResetOnConnectionFailures();

// Conditionally enable Wi-Fi PHY mode 11G (ESP8266 only).
#if defined(ESP8266)
#if ENABLE_WIFI_PHY_MODE_11G
  WiFi.setPhyMode(WIFI_PHY_MODE_11G);
  Serial.println("Wi-Fi PHY mode set to 11G.");
#else
  Serial.println("> Wi-Fi PHY mode 11G is disabled.");
#endif
#else
  Serial.println("> Wi-Fi PHY mode setting not applicable on this platform.");
#endif

  // Validate and log the configured reading schedule
  Serial.printf("> Reading schedule (configured): %s\n", readingSchedule);
  validateReadingSchedule();
  Serial.printf("> Reading schedule (effective): %s\n", readingSchedule);

  // Log effective frequency and warn if default is used
  Serial.printf("> Frequency (effective): %.6f MHz\n", (double)FREQUENCY);
#if FREQUENCY_DEFINED_DEFAULT
  Serial.println("WARNING: FREQUENCY not set in private.h; using default 433.820000 MHz (RADIAN).");
#endif

  // Optional functionalities of EspMQTTClient
#if ENABLE_MQTT_DEBUGGING
  mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output
  Serial.println(">> MQTT debugging enabled");
#endif

  // Set CC1101 radio frequency with automatic calibration
  Serial.println("> Initializing CC1101 radio...");
  float effectiveFrequency = FREQUENCY + storedFrequencyOffset;
  if (storedFrequencyOffset != 0.0)
  {
    Serial.printf("> Applying stored frequency offset: %.6f MHz (effective: %.6f MHz)\n",
                  storedFrequencyOffset, effectiveFrequency);
  }
  if (!cc1101_init(effectiveFrequency))
  {
    Serial.println("FATAL ERROR: CC1101 radio initialization failed!");
    Serial.println("Please check your wiring and connections.");
    while (true)
    {
      digitalWrite(LED_BUILTIN, LOW); // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }
  Serial.println("> CC1101 radio initialized successfully");

  /*
  // Use this piece of code to test
  struct tmeter_data meter_data;
  meter_data = get_meter_data();
  Serial.printf("\nVolume : %d\nBattery (in months) : %d\nCounter : %d\nTime start : %d\nTime end : %d\n\n", meter_data.volume, meter_data.battery_left, meter_data.reads_counter, meter_data.time_start, meter_data.time_end);
  while (42);
  */

  // Initialize connectivity watchdog timers
  g_bootMillis = millis();
  g_wifiAttemptStartMs = g_bootMillis;
  g_mqttAttemptStartMs = 0; // will start once Wi-Fi is up
  g_wifiOfflineSince = 0;
  g_mqttOfflineSince = 0;
  g_lastConnLogMs = 0;
  g_lastLedBlinkMs = millis();

  Serial.println("> Waiting for Wi-Fi/MQTT... timeouts enabled (Wi-Fi 30s, MQTT 30s). Will retry automatically.");
}

// ============================================================================
// Main Loop
// ============================================================================

/**
 * @brief Main loop function
 *
 * Handles MQTT communication, OTA updates, state machine execution,
 * and periodic WiFi diagnostics publishing.
 */
void loop()
{
  mqtt.loop();
  ArduinoOTA.handle();
  wifiSerialLoop();

  // Update diagnostics and Wi-Fi details every 5 minutes
  if (millis() - lastWifiUpdate > 300000)
  { // 5 minutes in ms
    publishWifiDetails();
    lastWifiUpdate = millis();
  }

  // ------------------------------
  // Connectivity watchdog & LED feedback
  // ------------------------------
  const bool wifiUp = mqtt.isWifiConnected();
  const bool mqttUp = mqtt.isMqttConnected();

  // Start WiFi serial server as soon as Wi-Fi is up (no wait for MQTT)
  if (wifiUp)
  {
    wifiSerialBegin();
  }

  // Log transitions to connected state (one-time per connect)
  if (wifiUp && !g_prevWifiUp)
  {
    Serial.printf("[Wi-Fi] Connected to '%s' (IP: %s, RSSI: %d dBm)\n",
                  WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
  }
  if (mqttUp && !g_prevMqttUp)
  {
    Serial.printf("[MQTT] Connected to %s:%d as '%s'\n",
                  mqtt.getMqttServerIp(), (int)mqtt.getMqttServerPort(), mqtt.getMqttClientName());
  }
  g_prevWifiUp = wifiUp;
  g_prevMqttUp = mqttUp;

  // Blink LED while offline (Wi-Fi or MQTT down)
  if (!(wifiUp && mqttUp))
  {
    if (millis() - g_lastLedBlinkMs >= OFFLINE_LED_BLINK_MS)
    {
      g_ledState = !g_ledState;
      digitalWrite(LED_BUILTIN, g_ledState ? LOW : HIGH); // active-low on many boards
      g_lastLedBlinkMs = millis();
    }
  }

  // Wi-Fi timeout and retry hinting (EspMQTTClient already retries; we add logs/force retry after timeout)
  if (!wifiUp)
  {
    if (g_wifiOfflineSince == 0)
      g_wifiOfflineSince = millis();
    // Start (or continue) Wi-Fi attempt timer
    if (g_wifiAttemptStartMs == 0)
      g_wifiAttemptStartMs = millis();

    // Periodic status log every ~5s so it doesn't look hung
    if (g_lastConnLogMs == 0 || millis() - g_lastConnLogMs > 5000)
    {
      wl_status_t st = WiFi.status();
      Serial.printf("[Wi-Fi] Connecting to '%s'... (status=%d: %s)\n", SECRET_WIFI_SSID, (int)st, wifiStatusToString(st));
      g_lastConnLogMs = millis();
    }

